{
  "syllables": [
    "a",
    "ai",
    "an",
    "ang",
    "ao",
    "ba",
    "bai",
    "ban",
    "bang",
    "bao",
    "be",
    "bei",
    "ben",
    "beng",
    "bi",
    "bia",
    "bian",
    "biang",
    "biao",
    "bie",
    "bin",
    "bing",
    "biong",
    "biu",
    "bo",
    "bong",
    "bou",
    "bu",
    "bua",
    "buai",
    "buan",
    "buang",
    "bueng",
    "bui",
    "bun",
    "ca",
    "cai",
    "can",
    "cang",
    "cao",
    "ce",
    "cei",
    "cen",
    "ceng",
    "cha",
    "chai",
    "chan",
    "chang",
    "chao",
    "che",
    "chei",
    "chen",
    "cheng",
    "chi",
    "cho",
    "chong",
    "chou",
    "chu",
    "chua",
    "chuai",
    "chuan",
    "chuang",
    "chueng",
    "chui",
    "chun",
    "chuo",
    "ci",
    "co",
    "cong",
    "cou",
    "cu",
    "cua",
    "cuai",
    "cuan",
    "cuang",
    "cueng",
    "cui",
    "cun",
    "cuo",
    "da",
    "dai",
    "dan",
    "dang",
    "dao",
    "de",
    "dei",
    "den",
    "deng",
    "di",
    "dia",
    "dian",
    "diang",
    "diao",
    "die",
    "din",
    "ding",
    "diong",
    "diu",
    "do",
    "dong",
    "dou",
    "du",
    "dua",
    "duai",
    "duan",
    "duang",
    "dueng",
    "dui",
    "dun",
    "duo",
    "e",
    "ei",
    "en",
    "eng",
    "er",
    "fa",
    "fai",
    "fan",
    "fang",
    "fao",
    "fe",
    "fen",
    "feng",
    "fo",
    "fong",
    "fou",
    "fu",
    "fua",
    "fuai",
    "fuan",
    "fuang",
    "fueng",
    "fui",
    "fun",
    "ga",
    "gai",
    "gan",
    "gang",
    "gao",
    "ge",
    "gen",
    "geng",
    "go",
    "gong",
    "gou",
    "gu",
    "gua",
    "guai",
    "guan",
    "guang",
    "gueng",
    "gui",
    "gun",
    "guo",
    "ha",
    "hai",
    "han",
    "hang",
    "hao",
    "he",
    "hen",
    "heng",
    "ho",
    "hong",
    "hou",
    "hu",
    "hua",
    "huai",
    "huan",
    "huang",
    "hueng",
    "hui",
    "hun",
    "huo",
    "ji",
    "jia",
    "jian",
    "jiang",
    "jiao",
    "jie",
    "jin",
    "jing",
    "jiong",
    "jiu",
    "ju",
    "juan",
    "jue",
    "jun",
    "ka",
    "kai",
    "kan",
    "kang",
    "kao",
    "ke",
    "ken",
    "keng",
    "ko",
    "kong",
    "kou",
    "ku",
    "kua",
    "kuai",
    "kuan",
    "kuang",
    "kueng",
    "kui",
    "kun",
    "kuo",
    "la",
    "lai",
    "lan",
    "lang",
    "lao",
    "le",
    "lei",
    "len",
    "leng",
    "li",
    "lia",
    "lian",
    "liang",
    "liao",
    "lie",
    "lin",
    "ling",
    "liong",
    "liu",
    "lo",
    "long",
    "lou",
    "lu",
    "lua",
    "luai",
    "luan",
    "luang",
    "lueng",
    "lui",
    "lun",
    "luo",
    "lü",
    "lüan",
    "lüe",
    "lün",
    "ma",
    "mai",
    "man",
    "mang",
    "mao",
    "me",
    "mei",
    "men",
    "meng",
    "mi",
    "mia",
    "mian",
    "miang",
    "miao",
    "mie",
    "min",
    "ming",
    "miong",
    "miu",
    "mo",
    "mong",
    "mou",
    "mu",
    "mua",
    "muai",
    "muan",
    "muang",
    "mueng",
    "mui",
    "mun",
    "na",
    "nai",
    "nan",
    "nang",
    "nao",
    "ne",
    "nei",
    "nen",
    "neng",
    "ni",
    "nia",
    "nian",
    "niang",
    "niao",
    "nie",
    "nin",
    "ning",
    "niong",
    "niu",
    "no",
    "nong",
    "nou",
    "nu",
    "nua",
    "nuai",
    "nuan",
    "nuang",
    "nueng",
    "nui",
    "nun",
    "nuo",
    "nü",
    "nüan",
    "nüe",
    "nün",
    "o",
    "ou",
    "pa",
    "pai",
    "pan",
    "pang",
    "pao",
    "pe",
    "pei",
    "pen",
    "peng",
    "pi",
    "pia",
    "pian",
    "piang",
    "piao",
    "pie",
    "pin",
    "ping",
    "piong",
    "piu",
    "po",
    "pong",
    "pou",
    "pu",
    "pua",
    "puai",
    "puan",
    "puang",
    "pueng",
    "pui",
    "pun",
    "qi",
    "qia",
    "qian",
    "qiang",
    "qiao",
    "qie",
    "qin",
    "qing",
    "qiong",
    "qiu",
    "qu",
    "quan",
    "que",
    "qun",
    "ra",
    "rai",
    "ran",
    "rang",
    "rao",
    "re",
    "rei",
    "ren",
    "reng",
    "ri",
    "ro",
    "rong",
    "rou",
    "ru",
    "rua",
    "ruai",
    "ruan",
    "ruang",
    "rueng",
    "rui",
    "run",
    "ruo",
    "sa",
    "sai",
    "san",
    "sang",
    "sao",
    "se",
    "sei",
    "sen",
    "seng",
    "sha",
    "shai",
    "shan",
    "shang",
    "shao",
    "she",
    "shen",
    "sheng",
    "shi",
    "sho",
    "shong",
    "shou",
    "shu",
    "shua",
    "shuai",
    "shuan",
    "shuang",
    "shueng",
    "shui",
    "shun",
    "shuo",
    "si",
    "so",
    "song",
    "sou",
    "su",
    "sua",
    "suai",
    "suan",
    "suang",
    "sueng",
    "sui",
    "sun",
    "suo",
    "ta",
    "tai",
    "tan",
    "tang",
    "tao",
    "te",
    "tei",
    "ten",
    "teng",
    "ti",
    "tia",
    "tian",
    "tiang",
    "tiao",
    "tie",
    "tin",
    "ting",
    "tiong",
    "tiu",
    "to",
    "tong",
    "tou",
    "tu",
    "tua",
    "tuai",
    "tuan",
    "tuang",
    "tueng",
    "tui",
    "tun",
    "tuo",
    "wa",
    "wai",
    "wan",
    "wang",
    "wei",
    "wen",
    "weng",
    "wo",
    "wu",
    "xi",
    "xia",
    "xian",
    "xiang",
    "xiao",
    "xie",
    "xin",
    "xing",
    "xiong",
    "xiu",
    "xu",
    "xuan",
    "xue",
    "xun",
    "ya",
    "yan",
    "yang",
    "yao",
    "ye",
    "yi",
    "yin",
    "ying",
    "yong",
    "you",
    "yu",
    "yuan",
    "yue",
    "yun",
    "za",
    "zai",
    "zan",
    "zang",
    "zao",
    "ze",
    "zei",
    "zen",
    "zeng",
    "zha",
    "zhai",
    "zhan",
    "zhang",
    "zhao",
    "zhe",
    "zhen",
    "zheng",
    "zhi",
    "zho",
    "zhong",
    "zhou",
    "zhu",
    "zhua",
    "zhuai",
    "zhuan",
    "zhuang",
    "zhueng",
    "zhui",
    "zhun",
    "zhuo",
    "zi",
    "zo",
    "zong",
    "zou",
    "zu",
    "zua",
    "zuai",
    "zuan",
    "zuang",
    "zueng",
    "zui",
    "zun",
    "zuo"
  ]
}